// © Copyright 2010-2015 HP Development Company, L.P.

// SSMDeviceWorkflowManager

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Workflow copy failed";
"COPY_WORKFLOWS_DESC" = "Failed to copy the workflows to the user-device domain folder";

"ERROR" = "Error";
"ERROR_UNKNOWN_DESC" = "An unknown error occurred.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Workflow creation failed";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "An unknown error occurred while creating the workflow. Please try again.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Error creating directory";
"ERROR_CREATING_DIR_DESC" = "There was an error creating the directory %@. Please check the access privileges of the parent folder and then try again";

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Scan Shortcut not supported";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "The selected scan shortcut cannot be executed since its not recognized by the software. Please select a different scan shortcut and try again.";

"Your HP device has sent a status message. This message could not be saved" = "Your HP device has sent a status message. This message could not be saved";
